#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс 

Функция ПолучитьСообщенияКОтправке() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ИсходящиеСообщения.ИдентификаторСообщения КАК ИдентификаторСообщения,
	               |	ИсходящиеСообщения.ТелоСообщения КАК ТелоСообщения,
	               |	ИсходящиеСообщения.Статус КАК Статус,
	               |	ИсходящиеСообщения.ИдентификаторЗапроса КАК ИдентификаторЗапроса,
	               |	ИсходящиеСообщения.ТипСообщения КАК ТипСообщения
	               |ИЗ
	               |	РегистрСведений.УС_ИсходящиеСообщения КАК ИсходящиеСообщения
	               |ГДЕ
	               |	ИсходящиеСообщения.Статус = &Статус";
	
	Запрос.УстановитьПараметр("Статус", Перечисления.УС_СтатусыСообщений.Новое);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Процедура УстановитьСтатусСообщения(ИдентификаторСообщения, Статус) Экспорт
	
	мз = РегистрыСведений.УС_ИсходящиеСообщения.СоздатьМенеджерЗаписи();
	мз.ИдентификаторСообщения = ИдентификаторСообщения;
	
	мз.Прочитать();
	
	Если мз.Выбран() Тогда
		
		мз.Статус = Статус;
		мз.Записать();
		
	КонецЕсли;	
		
	
КонецПроцедуры	

Процедура ЗаписатьСообщение(СтруктураСообщения) Экспорт
	
	мз = РегистрыСведений.УС_ИсходящиеСообщения.СоздатьМенеджерЗаписи();
	
	ЗаполнитьЗначенияСвойств(мз, СтруктураСообщения);
	
	мз.Статус = Перечисления.УС_СтатусыСообщений.Новое;
	
	мз.Записать();
		
КонецПроцедуры	

#КонецОбласти

#Область ОбработчикиСобытий

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#КонецЕсли