#Область ПрограммныйИнтерфейс

Функция ПолучитьНастройки() Экспорт 
	
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	УС_УзлыОбмена.Ссылка КАК Узел,
	               |	УС_УзлыОбмена.Сервер КАК Сервер,
	               |	УС_УзлыОбмена.ОчередьВходящих КАК ОчередьВходящих,
	               |	УС_УзлыОбмена.ОчередьИсходящих КАК ОчередьИсходящих,
	               |	УС_УзлыОбмена.Получатель КАК Получатель
	               |ИЗ
	               |	ПланОбмена.УС_УзлыОбмена КАК УС_УзлыОбмена
	               |ГДЕ
	               |	НЕ УС_УзлыОбмена.ЭтотУзел";
	
	ТаблицаНастроек = Запрос.Выполнить().Выгрузить();	
	
	Возврат ТаблицаНастроек;
	
КонецФункции  


Функция ПолучитьУзлыОбмена() Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	УС_УзлыОбмена.Ссылка КАК Узел
	               |ИЗ
	               |	ПланОбмена.УС_УзлыОбмена КАК УС_УзлыОбмена
	               |ГДЕ
	               |	НЕ УС_УзлыОбмена.ЭтотУзел"; 
	//Запрос.УстановитьПараметр("ЭтотУзел", ПланыОбмена.УС_Обмен.ЭтотУзел()
	Узлы = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Узел");	
	
	Возврат Узлы;
	
КонецФункции	

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#КонецОбласти

#Область СлужебныеПроцедурыИФункции


#КонецОбласти