
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ОстаткиПоСертификатам Приход
	Движения.УС_ОстаткиПоСертификатам.Записывать = Истина;
	Движение = Движения.УС_ОстаткиПоСертификатам.Добавить();
	
	Если ВидОперации = Перечисления.УС_ВидыОперацииСертификатов.Начисление Тогда
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход; 
	Иначе
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;	
	КонецЕсли;	
		
	Движение.Период = Дата;
	Движение.Сертификат = Сертификат;
	Движение.Сумма = Сумма;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры


#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли