#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс 

Процедура ЗаписатьСообщение(СтруктураСообщения) Экспорт
	
	мз = РегистрыСведений.УС_ВходящиеСообщения.СоздатьМенеджерЗаписи();
	
	ЗаполнитьЗначенияСвойств(мз, СтруктураСообщения);
	
	мз.Статус = Перечисления.УС_СтатусыСообщений.Новое;
	
	мз.Записать();
		
КонецПроцедуры	


Процедура УстановитьСтатусСообщения(ИдентификаторСообщения, Статус, Ошибка = Неопределено) Экспорт
	
	мз = РегистрыСведений.УС_ВходящиеСообщения.СоздатьМенеджерЗаписи();
	мз.ИдентификаторСообщения = ИдентификаторСообщения;
	
	мз.Прочитать();
	
	Если мз.Выбран() Тогда
		
		мз.Статус = Статус; 
		мз.Ошибка = Ошибка;
		мз.Записать();
		
	КонецЕсли;			
	
КонецПроцедуры


Функция ПолучитьСообщенияКОбработке() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ИсходящиеСообщения.ИдентификаторСообщения КАК ИдентификаторСообщения,
	               |	ИсходящиеСообщения.ТелоСообщения КАК ТелоСообщения,
	               |	ИсходящиеСообщения.Статус КАК Статус,
	               |	ИсходящиеСообщения.ИдентификаторЗапроса КАК ИдентификаторЗапроса,
	               |	ИсходящиеСообщения.ТипСообщения КАК ТипСообщения
	               |ИЗ
	               |	РегистрСведений.УС_ВходящиеСообщения КАК ИсходящиеСообщения
	               |ГДЕ
	               |	ИсходящиеСообщения.Статус = &Статус";
	
	Запрос.УстановитьПараметр("Статус", Перечисления.УС_СтатусыСообщений.Новое);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции



#КонецОбласти

#Область ОбработчикиСобытий

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#КонецЕсли