
#Область ОбработчикиСобытийФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти


#Область ОбработчикиКомандФормы 

&НаКлиенте
Процедура АктивироватьКарту(Команда)
	АктивироватьКартуНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура ВыполнитьСписание(Команда)
	ВыполнитьСписаниеНаСервере();
КонецПроцедуры



&НаКлиенте
Процедура ИнформацияПоКарте(Команда)
	ИнформацияПоКартеНаСервере();
КонецПроцедуры



#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура АктивироватьКартуНаСервере() 
	
	ВремяНачалаЗамера = ОценкаПроизводительности.НачатьЗамерВремени();
	
	ТипСообщения = XMLСтрока(Перечисления.УС_ТипыСообщений.АктивацияКарты);
	
	
	//Формируем тело сообщения
	СтруктураСообщения = Новый Структура;
	СтруктураСообщения.Вставить("ТипСообщения", ТипСообщения); 
	СтруктураСообщения.Вставить("НомерСертификата", НомерСертификата); 
	СтруктураСообщения.Вставить("Номинал",  Номинал);
	СтруктураСообщения.Вставить("Владелец", Владелец);
	
	ТелоСообщения = УС_ОтправкаПолучениеСообщенийСервер.СтруктуруВJSON(СтруктураСообщения);
	ИдентификаторСообщения = СокрЛП(Новый УникальныйИдентификатор);
	
	СтруктураСообщения = Новый Структура;
	СтруктураСообщения.Вставить("ИдентификаторСообщения", ИдентификаторСообщения);
	СтруктураСообщения.Вставить("ТелоСообщения", ТелоСообщения); 
	СтруктураСообщения.Вставить("ТипСообщения", Перечисления.УС_ТипыСообщений.АктивацияКарты);
		
	РегистрыСведений.УС_ИсходящиеСообщения.ЗаписатьСообщение(СтруктураСообщения); 
	
	Сообщить("Сообщения сформировано");  
	
	ОценкаПроизводительности.ЗакончитьЗамерВремени("ОтправкаАктивацииКарты",ВремяНачалаЗамера);
	
КонецПроцедуры


&НаСервере
Процедура ВыполнитьСписаниеНаСервере() 
	
	ВремяНачалаЗамера = ОценкаПроизводительности.НачатьЗамерВремени();
	
	ТипСообщения = XMLСтрока(Перечисления.УС_ТипыСообщений.Списание);
	
	
	//Формируем тело сообщения
	СтруктураСообщения = Новый Структура;
	СтруктураСообщения.Вставить("ТипСообщения", ТипСообщения); 
	СтруктураСообщения.Вставить("НомерСертификата", НомерСертификата); 
	СтруктураСообщения.Вставить("Списать",  Списать);
		
	ТелоСообщения = УС_ОтправкаПолучениеСообщенийСервер.СтруктуруВJSON(СтруктураСообщения);
	ИдентификаторСообщения = СокрЛП(Новый УникальныйИдентификатор);
	
	СтруктураСообщения = Новый Структура;
	СтруктураСообщения.Вставить("ИдентификаторСообщения", ИдентификаторСообщения);
	СтруктураСообщения.Вставить("ТелоСообщения", ТелоСообщения); 
	СтруктураСообщения.Вставить("ТипСообщения", Перечисления.УС_ТипыСообщений.Списание);
		
	РегистрыСведений.УС_ИсходящиеСообщения.ЗаписатьСообщение(СтруктураСообщения); 
	
	Сообщить("Сообщения сформировано");

	ОценкаПроизводительности.ЗакончитьЗамерВремени("ОтправкаСписания",ВремяНачалаЗамера);
	
КонецПроцедуры

&НаСервере
Процедура ИнформацияПоКартеНаСервере()
	
	
	ВремяНачалаЗамера = ОценкаПроизводительности.НачатьЗамерВремени();
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	УС_ИнформацияПоСертификатамСрезПоследних.Период КАК Период,
	               |	УС_ИнформацияПоСертификатамСрезПоследних.НомерСертификата КАК НомерСертификата,
	               |	УС_ИнформацияПоСертификатамСрезПоследних.Остаток КАК Остаток,
	               |	УС_ИнформацияПоСертификатамСрезПоследних.Владелец КАК Владелец
	               |ИЗ
	               |	РегистрСведений.УС_ИнформацияПоСертификатам.СрезПоследних(, НомерСертификата = &НомерСертификата) КАК УС_ИнформацияПоСертификатамСрезПоследних";
	Запрос.УстановитьПараметр("НомерСертификата", НомерСертификата);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		ОбщегоНазначения.СообщитьПользователю("Сертификат %1 остаток %2 владелец %3", 
		                                                  Выборка.НомерСертификата,
		                                                  Выборка.Остаток,
		                                                  Выборка.Владелец);
		
	КонецЕсли;	
													  
	ОценкаПроизводительности.ЗакончитьЗамерВремени("ПолучениеИнформацииПоКарте",ВремяНачалаЗамера);												  
	
КонецПроцедуры
 
#КонецОбласти	
	
	
	
	
	
	
	
	
	

